## Introduction to Panda's

In [1]:
import pandas as pd

In [2]:
s = pd.Series([1,2,3,4,5,6])

In [3]:
s

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [9]:
s = pd.Series([1,2,3,4,5,6], index=['a','b','c','d','e','f']) #Series one dimensional hoti h

In [10]:
s

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [11]:
df = pd.DataFrame({"names": ["Chirag", "Akhil","Avani","Akshi"], "marks":[100,90,99,98]}) #dataframe two dimensional hote h

In [12]:
df

    names  marks
0  Chirag    100
1   Akhil     90
2   Avani     99
3   Akshi     98

In [16]:
data = {
    'Name':[ "Chirag", "Akhil","Avani","Akshi"],
    'Age': [21,34,22,23],
    'marks': [100,99,89,89]
}

In [17]:
df = pd.DataFrame(data)

In [18]:
df

     Name  Age  marks
0  Chirag   21    100
1   Akhil   34     99
2   Avani   22     89
3   Akshi   23     89